server/app/controllers/thoughts_controller.rb

INSERT INTO "thoughts" ("text", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["text", "This is a new thought"], ["user_id", 106], ["created_at", "2019-02-17 18:35:52.585088"], ["updated_at", "2019-02-17 18:35:52.585088"]]
---
  def create
    text = params.require(:text)
    thought = Thought.create!(text: text, user: current_user)

SELECT  "thoughts".* FROM "thoughts" WHERE (text LIKE 'cheese') ORDER BY "thoughts"."updated_at" DESC LIMIT $1  [["LIMIT", 10]]
SELECT  "thoughts".* FROM "thoughts" ORDER BY "thoughts"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  def index
    filter = params[:filter]
    limit = params[:limit].try(:to_i) || 10

    if filter.present?
      thoughts = Thought.search_for(filter).order(updated_at: :desc).limit(limit)
    else
      thoughts = Thought.order(updated_at: :desc).limit(limit)
    end

    render json: thoughts.map(&:api_response_json)