server/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "jeff"], ["LIMIT", 1]]
INSERT INTO "users" ("username", "password_digest", "salt", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    username = params.require(:username).downcase
    password = params.require(:password)

    existing = User.find_by_username(username)
    return render json: { error: 'User already exists' }, status: 400 if existing.present?

    salt = SecureRandom.uuid
    user = User.create!(username: username, salt: salt, password: salt + password)

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "jeff"], ["LIMIT", 1]]
---
  def authenticate
    username = params.require(:username).downcase
    password = params.require(:password)

    user = User.find_by_username(username)